Revit 2027 API
BuiltInFailures.GeneralFailures.CharactersNotAllowed Property
 Name cannot contain any of the following characters:\n[{}[]|;<>?`~]\nor any of the non-printable characters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CharactersNotAllowed { get; }
Public Shared ReadOnly Property CharactersNotAllowed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CharactersNotAllowed {
	FailureDefinitionId^ get ();
}
static member CharactersNotAllowed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace